{
  "_comment": "Ship log entries. Each entry needs: id, timestamp, sender, subject, level, detail. Optional: mediaType ('text'|'image'|'video'), mediaUrl, classification. Level: '' | 'warning' | 'critical'. Classification: '' | 'PERSONAL' | 'SYSTEM' | 'MU/TH/UR' | 'MEDICAL' | 'CONFIDENTIAL' | 'SENSITIVE' | 'RESTRICTED' | 'CORPORATE'.",
  "logs": [
    {
      "id": "log-p001",
      "timestamp": "2183-03-14 21:40:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — CAPTAIN VANESSA MILLER\nDATE: MARCH 14, 2183\n\nRAN THE NUMBERS AGAIN TONIGHT. EVEN WITH THE BONUS FROM THE TRITIUM HAUL, I AM STILL SHORT ON THE LEASE-TO-BUY OPTION THE COMPANY OFFERED ON THE MONTERO. AND THAT IS BEFORE THE ENGINE OVERHAUL SHE NEEDS TO TRACTOR BIGGER LOADS.\n\nEVERY RUN WE LOSE THOUSANDS BECAUSE THIS OLD GIRL CANNOT KEEP UP WITH THE NEWER FREIGHTERS. I HAVE BEEN AT THIS FOR FIFTEEN YEARS AND I AM STILL JUST A COG IN THE WY MACHINE.\n\nIF I COULD GO INDEPENDENT, GET A NEWER SHIP OR AT LEAST UPGRADE HER FEL DRIVE, EVERYTHING CHANGES. BUT THE FRONTIER DOES NOT HAND OUT BREAKS.\n\nMAYBE THE NEXT RUN PAYS BETTER. THAT IS WHAT I ALWAYS SAY..",
      "sender": "MILLER",
      "subject": "PERSONAL — FINANCIAL REVIEW",
      "mediaType": "text"
    },
    {
      "id": "log-p002",
      "timestamp": "2183-03-22 03:15:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — LEAH DAVIS\nDATE: MARCH 22, 2183\n\nCANNOT SLEEP. BEEN RUNNING CARGO LOADING SIMS JUST TO HAVE SOMETHING TO DO BUT EVEN THOSE ARE GETTING OLD. THIS ROUTE TO SUTTERS WORLD IS THE LONGEST MILK RUN WE HAVE HAD IN MONTHS AND WE ARE NOT EVEN AT THE FTL JUMP YET.\n\nPILL BOTTLE IS LOOKING THIN. MAYBE SIX OR SEVEN LEFT. COMPANY PRESCRIPTION RENEWAL IS NOT UNTIL WE HIT PORT AND THAT IS WEEKS AWAY.\n\nGOING TO HAVE TO RATION. OR FIND ANOTHER SOURCE. NEITHER OPTION IS GREAT.\n\nPUSHED THE LOADING ARM PAST REDLINE AGAIN TODAY JUST FOR THE RUSH. CHAM GAVE ME A LOOK BUT DID NOT SAY ANYTHING. HE IS GOOD LIKE THAT..",
      "sender": "DAVIS",
      "subject": "PERSONAL — CANNOT SLEEP",
      "mediaType": "text"
    },
    {
      "id": "log-p003",
      "timestamp": "2183-04-02 19:30:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — KAYLA RYLE\nDATE: APRIL 2, 2183\n\nGOT ANOTHER MESSAGE FROM MOM BEFORE WE WENT OUT OF COMMS RANGE. SAME AS ALWAYS. TYLERS MEDICATION COSTS WENT UP AGAIN. THIRD TIME THIS YEAR. SHE DID NOT ASK FOR MORE MONEY BUT I COULD HEAR IT IN HER VOICE.\n\nSENT HER EVERYTHING I HAD LEFT FROM LAST MONTHS PAY. KEPT FORTY DOLLARS FOR MYSELF. FORTY DOLLARS FOR A MONTH.\n\nMEANWHILE WILSON SITS IN THE LOUNGE DRINKING REAL COFFEE LIKE HE IS ON VACATION. COMPANY LIAISON. WHAT A JOKE. HE GETS PAID MORE THAN I DO TO WRITE REPORTS NOBODY READS.\n\nI NEED TO FIND AN ANGLE ON THIS RUN. SOMETHING EXTRA. LOYALTY DOES NOT PAY THE BILLS AND I AM TIRED OF PRETENDING IT DOES.",
      "sender": "RYLE",
      "subject": "PERSONAL — FAMILY MATTERS",
      "mediaType": "text"
    },
    {
      "id": "log-p004",
      "timestamp": "2183-04-18 12:05:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — LYRON CHAM\nDATE: APRIL 18, 2183\n\nHAD DINNER WITH THE WHOLE CREW TONIGHT. MILLER COOKED. IT WAS TERRIBLE BUT NOBODY COMPLAINED. EVEN RYE WAS SMILING FOR ONCE AND DAVIS TOLD THAT STORY ABOUT THE CARGO LOADER ON THEDUS AGAIN.\n\nGREW UP HOPPING FROM COLONY TO COLONY WITH MY PARENTS. NEVER STAYED ANYWHERE LONG ENOUGH TO CALL IT HOME. NEVER HAD REAL FRIENDS.\n\nTHIS CREW IS DIFFERENT. THEY ARE LOUD AND DIFFICULT AND SOMETIMES THEY FIGHT OVER NOTHING. BUT THEY ARE THE CLOSEST THING TO A FAMILY I HAVE EVER HAD. DYSFUNCTION AND ALL.\n\nI WOULD DO ANYTHING TO KEEP THEM SAFE. I DO NOT SAY THAT OUT LOUD BECAUSE IT WOULD SOUND STRANGE. BUT I MEAN IT.",
      "sender": "CHAM",
      "subject": "PERSONAL — CREW DINNER",
      "mediaType": "text"
    },
    {
      "id": "log-p005",
      "timestamp": "2183-05-09 08:20:00",
      "level": "",
      "default": true,
      "classification": "CONFIDENTIAL",
      "detail": "PERSONAL LOG — JOHN WILSON\nDATE: MAY 9, 2183\n\nSIX MONTHS EMBEDDED WITH THIS CREW NOW. EVALUATION IS NEARLY COMPLETE. ON PAPER THEY ARE MARGINAL — THE MONTERO IS AGING, EFFICIENCY METRICS ARE BELOW TARGET, AND MORALE IS INCONSISTENT.\n\nBUT THE TRUTH IS I HAVE COME TO LIKE THEM. MILLER IS STUBBORN BUT COMPETENT. CHAM IS RELIABLE. EVEN RYE HAS A WORK ETHIC UNDER ALL THAT BITTERNESS.\n\nSTILL. THERE IS NO ROOM FOR SENTIMENT IN THIS LINE OF WORK. THE COMPANY EXPECTS RESULTS AND I INTEND TO DELIVER. IF AN OPPORTUNITY PRESENTS ITSELF TO ADVANCE, I WILL TAKE IT. THAT IS SIMPLY GOOD BUSINESS.\n\nACCESS KEYCARD IS CURRENT. ALL SYSTEMS NOMINAL.",
      "sender": "WILSON",
      "subject": "PERSONAL — CREW EVALUATION NOTES",
      "mediaType": "text"
    },
    {
      "id": "log-p006",
      "timestamp": "2183-05-29 22:50:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — CAPTAIN VANESSA MILLER\nDATE: MAY 29, 2183\n\nLAST ENTRY BEFORE CRYO. 72 TRITIUM TANKS SECURED IN THE HOLD. DAVIS RAN FINAL CHECKS ON THE FEL DRIVE. CHAM DOUBLE CHECKED THE CARGO LOCKS LIKE HE ALWAYS DOES. GOOD MAN.\n\nCRYOSLEEP REVIVAL SET FOR APPROACH TO SUTTERS WORLD. STANDARD RUN. NOTHING FANCY.\n\nTOLD THE CREW TO GET SOME REST BEFORE WE GO UNDER. NOBODY LIKES CRYO BUT IT BEATS SITTING IN A TIN CAN FOR WEEKS WITH NOTHING TO DO.\n\nI KEEP THINKING ABOUT THAT LEASE OPTION. MAYBE AFTER THIS RUN I WILL FINALLY HAVE ENOUGH TO START THE CONVERSATION WITH WY FINANCE.\n\nOR MAYBE I WILL JUST KEEP TELLING MYSELF THAT.\n\nSEE YOU ON THE OTHER SIDE.",
      "sender": "MILLER",
      "subject": "PERSONAL — PRE-CRYOSLEEP FINAL LOG",
      "mediaType": "text"
    },
    {
      "id": "log-p007",
      "timestamp": "2183-06-01 14:30:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "detail": "PERSONAL LOG — LYRON CHAM\nDATE: JUNE 1, 2183\n\nRECORDING THIS IN THE CARGO BAY BEFORE MY CRYO SHIFT. QUIET DOWN HERE. JUST THE HUM OF THE TRITIUM TANKS AND THE AIR CYCLERS.\n\nFOUND MY ROSARY IN MY JACKET POCKET. HAVE NOT PRAYED IN A LONG TIME BUT I HELD IT FOR A WHILE TONIGHT. MY PARENTS WERE NOT RELIGIOUS BUT SOMEONE ON ACHERON GAVE IT TO ME WHEN I WAS A KID. TOLD ME IT WOULD KEEP ME SAFE.\n\nI DO NOT KNOW IF I BELIEVE THAT. BUT I KEEP IT ANYWAY.\n\nEVERYONE IS ACCOUNTED FOR. MILLER IS ON THE BRIDGE DOING FINAL CHECKS. RYE IS ALREADY IN HER POD BECAUSE SHE SAID SHE WANTED TO GET IT OVER WITH. DAVIS IS PROBABLY FLYING SIMS SOMEWHERE.\n\nSEE YOU ALL ON THE OTHER SIDE.",
      "sender": "CHAM",
      "subject": "PERSONAL — BEFORE CRYO",
      "mediaType": "text"
    },
    {
      "id": "log-001",
      "timestamp": "2183-06-12 06:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "detail": "AUTOMATED CRYOSLEEP REVIVAL SEQUENCE INITIATED PER NAVIGATION PROTOCOL.\nALL CRYOPODS REPORTING NOMINAL STATUS.\n\nPOD 01 — MILLER, C. — VITALS NOMINAL\nPOD 02 — CHAM, K. — VITALS NOMINAL\nPOD 03 — RYLE, T. — VITALS NOMINAL\nPOD 04 — WILSON, D. — VITALS NOMINAL\nPOD 05 — REID, J. — VITALS NOMINAL\nPOD 06 — DAVIS, M. — VITALS NOMINAL\nPOD 07 — LUCAS, E. — VITALS NOMINAL\n\nREVIVAL TIME: 47 MINUTES\nPOST-CRYO ASSESSMENT: ALL CREW FIT FOR DUTY",
      "sender": "SYSTEM",
      "subject": "CREW REVIVED FROM CRYOSLEEP",
      "mediaType": "text"
    },
    {
      "id": "log-002",
      "timestamp": "2183-06-12 06:05:00",
      "level": "warning",
      "default": true,
      "classification": "MU/TH/UR",
      "detail": "SIGNAL TYPE: REPEATING BURST TRANSMISSION\nFREQUENCY: 489.12 MHz (NON-STANDARD)\nSIGNAL STRENGTH: -72 dBm\nORIGIN: BEARING 127.4 / RANGE 2.4 AU\nSIGNAL DURATION: 12.7 SECONDS (REPEATING EVERY 180 SECONDS)\n\nANALYSIS: PATTERN DOES NOT MATCH ANY KNOWN WEYLAND-YUTANI, UPP, OR CIVILIAN BEACON PROTOCOL.\nCLASSIFICATION: UNKNOWN — POSSIBLE DISTRESS SIGNAL\n\nPER COMPANY STANDING ORDER ICC/WY-4720:\nALL COMMERCIAL VESSELS ARE OBLIGATED TO INVESTIGATE SIGNALS OF POSSIBLE INTELLIGENT ORIGIN.\n\nAWAITING BRIDGE CREW AUTHORIZATION FOR COURSE CHANGE.",
      "sender": "MU/TH/UR",
      "subject": "UNKNOWN SIGNAL DETECTED ON LONG-RANGE SENSORS",
      "mediaType": "text"
    },
    {
      "id": "log-003",
      "timestamp": "2183-06-12 06:10:00",
      "level": "",
      "default": true,
      "classification": "",
      "detail": "ORIGINAL HEADING: 042.7 / SOLOMONS — ETA 14 WEEKS\nNEW HEADING: 127.4 / UNKNOWN SIGNAL SOURCE\nDEVIATION: 84.7 DEGREES\nESTIMATED TRANSIT TIME: 6.2 HOURS AT CURRENT THRUST\n\nFUEL IMPACT: +2.4% RESERVE CONSUMPTION\nREMAINING FUEL AFTER MANEUVER: 84.6%\n\nCOURSE CHANGE AUTHORIZED BY: CAPTAIN MILLER\nNAV COMPUTER UPDATED. EXECUTING BURN IN T-MINUS 120 SECONDS.",
      "sender": "NAV",
      "subject": "COURSE CORRECTION CALCULATED FOR SIGNAL SOURCE",
      "mediaType": "text"
    },
    {
      "id": "log-c001",
      "timestamp": "2183-05-01 00:00:00",
      "level": "",
      "default": true,
      "classification": "CORPORATE",
      "detail": "CONFIDENTIAL — WEYLAND-YUTANI CORPORATE DIRECTIVE\nREF: WY-OPS/FRONTIER-7741\n\nTO: WILSON, J. — COMPANY LIAISON (USCSS MONTERO)\nFROM: FRONTIER OPERATIONS DIVISION\n\nRE: CREW EVALUATION & ASSET ASSESSMENT\n\nYOU ARE DIRECTED TO COMPLETE A FULL CREW PERFORMANCE AND\nLOYALTY ASSESSMENT FOR THE MONTERO CREW WITHIN 6 MONTHS.\n\nKEY METRICS:\n  — CAPTAIN MILLER: LEASE-TO-BUY LEVERAGE. ASSESS COMPLIANCE.\n  — PILOT DAVIS: PERFORMANCE RELIABILITY. FLAG ANY SUBSTANCE CONCERNS.\n  — ENGINEER CHAM: RETENTION VALUE. HIGH SKILL / LOW COST.\n  — ROUGHNECK RYLE: EVALUATE FOR TRANSFER OR TERMINATION.\n\nIF AN OPPORTUNITY ARISES TO REROUTE THE MONTERO FOR COMPANY\nPURPOSES, YOU ARE AUTHORIZED TO EXERCISE ICC CLAUSE 4720\n(SIGNAL INVESTIGATION) OR EQUIVALENT PRETEXT.\n\nCREW MUST NOT BECOME AWARE OF THIS DIRECTIVE.\nALL FINDINGS TO BE TRANSMITTED VIA ENCRYPTED BURST\nTO WY-OPS RELAY STATION GAMMA-7.\n\nAUTHORIZATION: DIRECTOR HOLT — FRONTIER OPS\nCLASSIFICATION: WY-CORPORATE — EYES ONLY",
      "sender": "WY-COMMS",
      "subject": "CORPORATE DIRECTIVE — CREW EVALUATION",
      "mediaType": "text"
    },
    {
      "id": "log-m001",
      "timestamp": "2183-06-12 06:02:00",
      "level": "",
      "default": true,
      "classification": "MEDICAL",
      "detail": "POST-CRYOSLEEP MEDICAL ASSESSMENT — ALL CREW\n\nMILLER, V. — FIT FOR DUTY. MILD CRYO-NAUSEA (STANDARD).\nCHAM, L. — FIT FOR DUTY. NO ANOMALIES.\nRYLE, K. — FIT FOR DUTY. ELEVATED HEART RATE (STRESS-RELATED).\nWILSON, J. — FIT FOR DUTY. NO ANOMALIES.\nREID, J. — FIT FOR DUTY. MINOR DEHYDRATION.\nDAVIS, L. — FIT FOR DUTY. NOTE: PRESCRIPTION RENEWAL OVERDUE.\nLUCAS, E. — FIT FOR DUTY. NO ANOMALIES.\n\nNO CONTRAINDICATIONS FOR EVA OR HEAVY LABOR.\nAUTO-MED PRESCRIPTION STATUS:\n  DAVIS, L. — ANXIOLYTIC RX: 3 DOSES REMAINING. RENEWAL REQUIRED.\n\nNEXT MEDICAL CHECK: 24 HOURS POST-REVIVAL.",
      "sender": "MEDICAL",
      "subject": "POST-CRYO MEDICAL CLEARANCE — ALL CREW",
      "mediaType": "text"
    }
  ]
}
