{
  "_comment": "Ship log entries. Each entry needs: id, timestamp, sender, subject, level, detail. Optional: mediaType ('text'|'image'|'video'), mediaUrl, classification. Level: '' | 'warning' | 'critical'. Classification: '' | 'PERSONAL' | 'SYSTEM' | 'MU/TH/UR' | 'MEDICAL' | 'CONFIDENTIAL' | 'SENSITIVE' | 'RESTRICTED' | 'CORPORATE'.",
  "logs": [
    {
      "id": "log-p000",
      "timestamp": "2183-03-10 18:15:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "MILLER",
      "subject": "PERSONAL — EMERGENCY TRITIUM CONTRACT",
      "mediaType": "text",
      "detail": "PERSONAL LOG — CAPTAIN VANESSA MILLER\nDATE: MARCH 10, 2183\n\nMET WITH JOHN WILSON AND TWO WEYLAND-YUTANI REPRESENTATIVES AT ANCHORPOINT TODAY. THEY WANT AN EMERGENCY TRITIUM RUN TO SUTTERS WORLD. SOMETHING ABOUT A REFINERY SHORTAGE AND A PRODUCTION DEADLINE THEY CANNOT MISS.\n\nTHE PAY IS THREE TIMES NORMAL RATES. THREE TIMES. I MADE THEM REPEAT IT BECAUSE I THOUGHT I HEARD WRONG. I DID NOT.\n\nWILSON IS COMING ALONG AS CORPORATE LIAISON. STANDARD PRACTICE FOR A HIGH VALUE HAUL APPARENTLY. HE SEEMS ALRIGHT. POLISHED. COMPANY MAN THROUGH AND THROUGH BUT NOT THE WORST I HAVE DEALT WITH.\n\nI DO NOT LOVE HAVING A WY SUIT LOOKING OVER MY SHOULDER FOR 90 DAYS BUT AT TRIPLE RATE I WILL SMILE AND NOD THE WHOLE WAY THERE. THIS IS THE KIND OF MONEY THAT CHANGES THINGS. THE LEASE OPTION. THE ENGINE OVERHAUL. MAYBE BOTH.\n\nTOLD THE CREW TONIGHT. DAVIS IS ALREADY PLOTTING THE ROUTE. CHAM JUST NODDED LIKE HE ALWAYS DOES. RYE ASKED HOW MUCH HER CUT WOULD BE BEFORE I EVEN FINISHED TALKING.\n\nWE LOAD THE TRITIUM TANKS TOMORROW. 72 HIGH PRESSURE UNITS. FULL BAY. SUTTERS WORLD OR BUST.\n\nTOO GOOD TO PASS UP."
    },
    {
      "id": "log-p008",
      "timestamp": "2183-03-13 16:30:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "CHAM",
      "subject": "PERSONAL — CARGO LOADING AND DEPARTURE PREP",
      "mediaType": "text",
      "detail": "PERSONAL LOG — LYRON CHAM\nDATE: MARCH 13, 2183\n\nSPENT THE LAST THREE DAYS LOADING TRITIUM INTO THE HOLD. 72 HIGH PRESSURE TANKS. EACH ONE HAS TO BE SECURED INDIVIDUALLY WITH MAGNETIC CLAMPS AND SHOCK DAMPENERS. ONE WRONG MOVE AND THE WHOLE BAY GOES UP.\n\nCARGO MANIFEST IS COMPLETE. ALL TANKS LOGGED AND ACCOUNTED FOR. RESEALED THE AFT CARGO LOCKS TWICE BECAUSE THE FIRST SET OF BOLTS DID NOT MEET SPEC. RATHER DO IT TWICE THAN DO IT WRONG.\n\nRAN A FULL INSPECTION ON THE CARGO LIFTER SLED. DAISY IS SHOWING HER AGE BUT SHE WILL HOLD. TOPPED OFF THE HYDRAULIC LINES AND REPLACED THE PORT SIDE COUPLING.\n\nMILLER WANTS TO DEPART TOMORROW. SHIP IS READY. ENGINE PRE CHECKS ARE GREEN. LIFE SUPPORT TOPPED OFF. RYE HELPED WITH THE FINAL CARGO NETTING THIS MORNING. DAVIS IS ON THE BRIDGE RUNNING NAV PLOTS.\n\nI DO NOT LIKE TRITIUM. FLAMMABLE GAS IN HIGH PRESSURE TANKS SITTING TEN METERS FROM WHERE I SLEEP. BUT THE PAY IS THE PAY AND MILLER SAYS THIS RUN CHANGES THINGS FOR ALL OF US.\n\nEVERYTHING IS SECURED. WE ARE GOOD TO GO."
    },
    {
      "id": "log-s001",
      "timestamp": "2183-03-14 08:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "sender": "NAV",
      "subject": "DEPARTURE — ANCHORPOINT STATION",
      "mediaType": "text",
      "detail": "NAV SYSTEM — DEPARTURE LOG\n\nUSCSS MONTERO (REG. 180924609) DEPARTED ANCHORPOINT STATION AT 08:00 UST.\n\nCOURSE: ANCHORPOINT STATION TO SUTTER'S WORLD\nDISTANCE: 12 PARSECS\nESTIMATED TRANSIT TIME: 96 DAYS\nETA: 2183-06-20\n\nSUBLIGHT DEPARTURE BURN COMPLETE. CLEARING ANCHORPOINT TRAFFIC CORRIDOR.\nFEL DRIVE PRE SPIN: NOMINAL. FTL JUMP WINDOW SCHEDULED DAY 19.\n\nCARGO: 72 HIGH PRESSURE TRITIUM TANKS — SECURED AND STABLE.\nCREW: 5 — ALL ABOARD AND FIT FOR DUTY.\n\nFUEL STATUS: 100%\nENGINE STATUS: NOMINAL\nLIFE SUPPORT: NOMINAL\n\nALL SYSTEMS GREEN. BEGINNING TRANSIT."
    },
    {
      "id": "log-p001",
      "timestamp": "2183-03-14 21:40:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "MILLER",
      "subject": "PERSONAL — FINANCIAL REVIEW",
      "mediaType": "text",
      "detail": "PERSONAL LOG — CAPTAIN VANESSA MILLER\nDATE: MARCH 14, 2183\n\nRAN THE NUMBERS AGAIN TONIGHT. EVEN WITH THE BONUS FROM THE TRITIUM HAUL, I AM STILL SHORT ON THE LEASE-TO-BUY OPTION THE COMPANY OFFERED ON THE MONTERO. AND THAT IS BEFORE THE ENGINE OVERHAUL SHE NEEDS TO TRACTOR BIGGER LOADS.\n\nEVERY RUN WE LOSE THOUSANDS BECAUSE THIS OLD GIRL CANNOT KEEP UP WITH THE NEWER FREIGHTERS. I HAVE BEEN AT THIS FOR FIFTEEN YEARS AND I AM STILL JUST A COG IN THE WY MACHINE.\n\nIF I COULD GO INDEPENDENT, GET A NEWER SHIP OR AT LEAST UPGRADE HER FEL DRIVE, EVERYTHING CHANGES. BUT THE FRONTIER DOES NOT HAND OUT BREAKS.\n\nMAYBE THE NEXT RUN PAYS BETTER. THAT IS WHAT I ALWAYS SAY.."
    },
    {
      "id": "log-p002",
      "timestamp": "2183-03-20 03:15:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "DAVIS",
      "subject": "PERSONAL — CANNOT SLEEP",
      "mediaType": "text",
      "detail": "PERSONAL LOG — LEAH DAVIS\nDATE: MARCH 20, 2183\n\nCANNOT SLEEP. BEEN RUNNING CARGO LOADING SIMS JUST TO HAVE SOMETHING TO DO BUT EVEN THOSE ARE GETTING OLD. THIS ROUTE TO SUTTERS WORLD IS THE LONGEST MILK RUN WE HAVE HAD IN MONTHS AND WE ARE NOT EVEN AT THE FTL JUMP YET.\n\nPILL BOTTLE IS LOOKING THIN. MAYBE SIX OR SEVEN LEFT. COMPANY PRESCRIPTION RENEWAL IS NOT UNTIL WE HIT PORT AND THAT IS WEEKS AWAY.\n\nGOING TO HAVE TO RATION. OR FIND ANOTHER SOURCE. NEITHER OPTION IS GREAT.\n\nPUSHED THE LOADING ARM PAST REDLINE AGAIN TODAY JUST FOR THE RUSH. CHAM GAVE ME A LOOK BUT DID NOT SAY ANYTHING. HE IS GOOD LIKE THAT.."
    },
    {
      "id": "log-p005",
      "timestamp": "2183-03-28 08:20:00",
      "level": "",
      "default": true,
      "classification": "CONFIDENTIAL",
      "sender": "WILSON",
      "subject": "PERSONAL — CREW EVALUATION NOTES",
      "mediaType": "text",
      "detail": "PERSONAL LOG — JOHN WILSON\nDATE: MARCH 28, 2183\n\nSIX MONTHS EMBEDDED WITH THIS CREW NOW. EVALUATION IS NEARLY COMPLETE. ON PAPER THEY ARE MARGINAL — THE MONTERO IS AGING, EFFICIENCY METRICS ARE BELOW TARGET, AND MORALE IS INCONSISTENT.\n\nBUT THE TRUTH IS I HAVE COME TO LIKE THEM. MILLER IS STUBBORN BUT COMPETENT. CHAM IS RELIABLE. EVEN RYE HAS A WORK ETHIC UNDER ALL THAT BITTERNESS.\n\nSTILL. THERE IS NO ROOM FOR SENTIMENT IN THIS LINE OF WORK. THE COMPANY EXPECTS RESULTS AND I INTEND TO DELIVER. IF AN OPPORTUNITY PRESENTS ITSELF TO ADVANCE, I WILL TAKE IT. THAT IS SIMPLY GOOD BUSINESS.\n\nACCESS KEYCARD IS CURRENT. ALL SYSTEMS NOMINAL."
    },
    {
      "id": "log-c001",
      "timestamp": "2183-03-30 00:00:00",
      "level": "",
      "default": true,
      "classification": "CORPORATE",
      "sender": "WY-COMMS",
      "subject": "CORPORATE DIRECTIVE — CREW EVALUATION",
      "mediaType": "text",
      "detail": "CONFIDENTIAL — WEYLAND-YUTANI CORPORATE DIRECTIVE\nREF: WY-OPS/FRONTIER-7741\n\nTO: WILSON, J. — COMPANY LIAISON (USCSS MONTERO)\nFROM: FRONTIER OPERATIONS DIVISION\n\nRE: CREW EVALUATION & ASSET ASSESSMENT\n\nYOU ARE DIRECTED TO COMPLETE A FULL CREW PERFORMANCE AND\nLOYALTY ASSESSMENT FOR THE MONTERO CREW WITHIN 6 MONTHS.\n\nKEY METRICS:\n  — CAPTAIN MILLER: LEASE-TO-BUY LEVERAGE. ASSESS COMPLIANCE.\n  — PILOT DAVIS: PERFORMANCE RELIABILITY. FLAG ANY SUBSTANCE CONCERNS.\n  — ENGINEER CHAM: RETENTION VALUE. HIGH SKILL / LOW COST.\n  — ROUGHNECK RYE: EVALUATE FOR TRANSFER OR TERMINATION.\n\nIF AN OPPORTUNITY ARISES TO REROUTE THE MONTERO FOR COMPANY\nPURPOSES, YOU ARE AUTHORIZED TO EXERCISE ICC CLAUSE 4720\n(SIGNAL INVESTIGATION) OR EQUIVALENT PRETEXT.\n\nCREW MUST NOT BECOME AWARE OF THIS DIRECTIVE.\nALL FINDINGS TO BE TRANSMITTED VIA ENCRYPTED BURST\nTO WY-OPS RELAY STATION GAMMA-7.\n\nAUTHORIZATION: DIRECTOR HOLT — FRONTIER OPS\nCLASSIFICATION: WY-CORPORATE — EYES ONLY"
    },
    {
      "id": "log-p004",
      "timestamp": "2183-03-31 12:05:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "CHAM",
      "subject": "PERSONAL — CREW DINNER",
      "mediaType": "text",
      "detail": "PERSONAL LOG — LYRON CHAM\nDATE: MARCH 31, 2183\n\nHAD DINNER WITH THE WHOLE CREW TONIGHT. MILLER COOKED. IT WAS TERRIBLE BUT NOBODY COMPLAINED. EVEN RYE WAS SMILING FOR ONCE AND DAVIS TOLD THAT STORY ABOUT THE CARGO LOADER ON THEDUS AGAIN.\n\nGREW UP HOPPING FROM COLONY TO COLONY WITH MY PARENTS. NEVER STAYED ANYWHERE LONG ENOUGH TO CALL IT HOME. NEVER HAD REAL FRIENDS.\n\nTHIS CREW IS DIFFERENT. THEY ARE LOUD AND DIFFICULT AND SOMETIMES THEY FIGHT OVER NOTHING. BUT THEY ARE THE CLOSEST THING TO A FAMILY I HAVE EVER HAD. DYSFUNCTION AND ALL.\n\nI WOULD DO ANYTHING TO KEEP THEM SAFE. I DO NOT SAY THAT OUT LOUD BECAUSE IT WOULD SOUND STRANGE. BUT I MEAN IT."
    },
    {
      "id": "log-p003",
      "timestamp": "2183-04-01 19:30:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "RYE",
      "subject": "PERSONAL — FAMILY MATTERS",
      "mediaType": "text",
      "detail": "PERSONAL LOG — KAYLA RYE\nDATE: APRIL 1, 2183\n\nGOT ANOTHER MESSAGE FROM MOM BEFORE WE WENT OUT OF COMMS RANGE. SAME AS ALWAYS. TYLERS MEDICATION COSTS WENT UP AGAIN. THIRD TIME THIS YEAR. SHE DID NOT ASK FOR MORE MONEY BUT I COULD HEAR IT IN HER VOICE.\n\nSENT HER EVERYTHING I HAD LEFT FROM LAST MONTHS PAY. KEPT FORTY DOLLARS FOR MYSELF. FORTY DOLLARS FOR A MONTH.\n\nMEANWHILE WILSON SITS IN THE LOUNGE DRINKING REAL COFFEE LIKE HE IS ON VACATION. COMPANY LIAISON. WHAT A JOKE. HE GETS PAID MORE THAN I DO TO WRITE REPORTS NOBODY READS.\n\nI NEED TO FIND AN ANGLE ON THIS RUN. SOMETHING EXTRA. LOYALTY DOES NOT PAY THE BILLS AND I AM TIRED OF PRETENDING IT DOES."
    },
    {
      "id": "log-p006",
      "timestamp": "2183-04-01 22:50:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "MILLER",
      "subject": "PERSONAL — PRE-CRYOSLEEP FINAL LOG",
      "mediaType": "text",
      "detail": "PERSONAL LOG — CAPTAIN VANESSA MILLER\nDATE: APRIL 1, 2183\n\nLAST ENTRY BEFORE CRYO. 72 TRITIUM TANKS SECURED IN THE HOLD. DAVIS RAN FINAL CHECKS ON THE FEL DRIVE. CHAM DOUBLE CHECKED THE CARGO LOCKS LIKE HE ALWAYS DOES. GOOD MAN.\n\nCRYOSLEEP REVIVAL SET FOR APPROACH TO SUTTERS WORLD. STANDARD RUN. NOTHING FANCY.\n\nTOLD THE CREW TO GET SOME REST BEFORE WE GO UNDER. NOBODY LIKES CRYO BUT IT BEATS SITTING IN A TIN CAN FOR WEEKS WITH NOTHING TO DO.\n\nI KEEP THINKING ABOUT THAT LEASE OPTION. MAYBE AFTER THIS RUN I WILL FINALLY HAVE ENOUGH TO START THE CONVERSATION WITH WY FINANCE.\n\nOR MAYBE I WILL JUST KEEP TELLING MYSELF THAT.\n\nSEE YOU ON THE OTHER SIDE."
    },
    {
      "id": "log-p007",
      "timestamp": "2183-04-02 06:00:00",
      "level": "",
      "default": true,
      "classification": "PERSONAL",
      "sender": "CHAM",
      "subject": "PERSONAL — BEFORE CRYO",
      "mediaType": "text",
      "detail": "PERSONAL LOG — LYRON CHAM\nDATE: APRIL 2, 2183\n\nRECORDING THIS IN THE CARGO BAY BEFORE MY CRYO SHIFT. QUIET DOWN HERE. JUST THE HUM OF THE TRITIUM TANKS AND THE AIR CYCLERS.\n\nFOUND MY ROSARY IN MY JACKET POCKET. HAVE NOT PRAYED IN A LONG TIME BUT I HELD IT FOR A WHILE TONIGHT. MY PARENTS WERE NOT RELIGIOUS BUT SOMEONE ON ACHERON GAVE IT TO ME WHEN I WAS A KID. TOLD ME IT WOULD KEEP ME SAFE.\n\nI DO NOT KNOW IF I BELIEVE THAT. BUT I KEEP IT ANYWAY.\n\nEVERYONE IS ACCOUNTED FOR. MILLER IS ON THE BRIDGE DOING FINAL CHECKS. RYE IS ALREADY IN HER POD BECAUSE SHE SAID SHE WANTED TO GET IT OVER WITH. DAVIS IS PROBABLY FLYING SIMS SOMEWHERE.\n\nSEE YOU ALL ON THE OTHER SIDE."
    },
    {
      "id": "log-s002",
      "timestamp": "2183-04-02 09:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "sender": "SYSTEM",
      "subject": "CRYOSLEEP INITIATED — FTL JUMP",
      "mediaType": "text",
      "detail": "SYSTEM LOG — CRYOGENIC HYPERSLEEP INITIATION\n\nALL CREW ENTERING CRYOGENIC HYPERSLEEP.\n\nPOD 01 — MILLER, V. — SEALED — VITALS NOMINAL\nPOD 02 — DAVIS, L. — SEALED — VITALS NOMINAL\nPOD 03 — RYE, K. — SEALED — VITALS NOMINAL\nPOD 04 — CHAM, L. — SEALED — VITALS NOMINAL\nPOD 05 — WILSON, J. — SEALED — VITALS NOMINAL\n\nHYPERSLEEP INITIATED: 2183-04-02 09:00 UST\nALL PODS NOMINAL. BIOMETRICS STABLE.\n\nFEL DRIVE ENGAGED. FTL JUMP INITIATED.\nCOURSE: SUTTER'S WORLD\nESTIMATED FTL TRANSIT: 79 DAYS\nETA AT DESTINATION: 2183-06-20\n\nMU/TH/UR 6500 ASSUMING AUTONOMOUS FLIGHT OPERATIONS.\nNEXT SCHEDULED CREW REVIVAL: APPROACH TO SUTTER'S WORLD.\n\nNOTE: TRITIUM CARGO HALF-LIFE DECAY IN PROGRESS. APPROXIMATELY\n50% OF CARGO WILL HAVE DECAYED TO HELIUM-3 BY MID-TRANSIT.\nREMAINDER STILL CLASSIFIED AS FLAMMABLE. CARGO BAY MONITORING\nACTIVE."
    },
    {
      "id": "log-c003",
      "timestamp": "2183-05-20 07:22:00",
      "level": "",
      "default": true,
      "classification": "RESTRICTED",
      "sender": "WY-COMMS",
      "subject": "PRIORITY — DISTRESS SIGNAL / RESCUE AND RECOVERY DIRECTIVE",
      "mediaType": "text",
      "detail": "PRIORITY TRANSMISSION — WEYLAND-YUTANI CORPORATE RELAY\nWY DEEP SPACE RELAY NODE GAMMA-7\nFREQUENCY: 8713.41 — WY CORPORATE RELAY BAND\nENCRYPTION: STANDARD COMMERCIAL (AES-2048)\n\nTO: CAPTAIN MILLER, V. — COMMANDING OFFICER (USCSS MONTERO)\nFROM: WEYLAND-YUTANI FRONTIER OPERATIONS — DEEP SPACE COORDINATION\n\nRE: DISTRESS SIGNAL INTERCEPT — MANDATORY RESCUE AND RECOVERY\n\nCAPTAIN MILLER,\n\nON 2183-05-19 AT 07:22 UST, WY DEEP SPACE RELAY NODE\nGAMMA-7 INTERCEPTED A REPEATING DISTRESS SIGNAL ORIGINATING\nFROM COORDINATES (24.3, 39.2), DEEP SPACE BETWEEN ALPHA\nAURIGAE AND LAMBDA AURIGAE. TRAJECTORY ANALYSIS INDICATES\nTHE MONTERO'S CURRENT FTL CORRIDOR PASSES WITHIN VIABLE\nINTERCEPT RANGE.\n\nPER INTERSTELLAR COMMERCE COMMISSION REGULATION ICC/WY-4720\nAND WEYLAND-YUTANI CORPORATE POLICY ON SEARCH AND RESCUE\nOPERATIONS (CLAUSE 8827.5, SUBSECTION B), ALL COMMERCIAL\nVESSELS WITHIN RANGE ARE REQUIRED TO INVESTIGATE SIGNALS OF\nPOSSIBLE DISTRESS ORIGIN. THIS IS A MANDATORY OBLIGATION\nUNDER BOTH ICC LAW AND YOUR WEYLAND-YUTANI OPERATING\nCONTRACT.\n\n--- SALVAGE RIGHTS ---\n\nPER ICC SALVAGE CODE ARTICLE 7, SECTION 12:\nANY VESSEL OR CARGO RECOVERED DURING AUTHORIZED SEARCH AND\nRESCUE OPERATIONS ENTITLES THE RECOVERING CREW TO STANDARD\nSALVAGE SHARES UNDER THE FOLLOWING TERMS:\n  — CLASS A SALVAGE (INTACT VESSEL): 15% OF ASSESSED VALUE\n  — CLASS B SALVAGE (PARTIAL RECOVERY): 10% OF ASSESSED VALUE\n  — CLASS C SALVAGE (DATA/MATERIALS ONLY): 5% OF ASSESSED VALUE\nSALVAGE SHARES ARE DISTRIBUTED PER CREW RANK AND CONTRACT\nTIER.\n\n--- COMPENSATION FOR DELAYS ---\n\nWEYLAND-YUTANI ACKNOWLEDGES THAT COMPLIANCE WITH THIS\nDIRECTIVE WILL RESULT IN DEVIATION FROM YOUR SCHEDULED\nROUTE AND DELIVERY TIMELINE. THE COMPANY GUARANTEES THE\nFOLLOWING:\n  — FULL COMPENSATION AT STANDARD RATE FOR ALL TRANSIT DELAYS\n  — FUEL COSTS INCURRED DURING THE DIVERSION WILL BE\n    REIMBURSED IN FULL UPON RETURN TO PORT\n  — NO PENALTY WILL BE ASSESSED FOR LATE DELIVERY OF YOUR\n    CURRENT TRITIUM CARGO TO SUTTER'S WORLD\n  — ADDITIONAL HAZARD PAY IF CONDITIONS WARRANT EVA OR\n    BOARDING OPERATIONS\n\nPLEASE MAINTAIN DETAILED RECORDS OF ALL FUEL EXPENDITURES,\nTRANSIT TIME, AND OPERATIONAL EXPENSES RELATED TO THIS\nDIVERSION. ALL DOCUMENTED COSTS WILL BE SUBMITTED FOR\nREIMBURSEMENT THROUGH WY FRONTIER OPERATIONS ACCOUNTING\nUPON RETURN TO PORT.\n\n--- INSTRUCTIONS ---\n\nMU/TH/UR HAS BEEN UPDATED WITH THE SIGNAL COORDINATES AND\nWILL ADJUST YOUR FTL EXIT POINT AND APPROACH VECTOR\nACCORDINGLY. UPON ARRIVAL AT THE SIGNAL SOURCE, ASSESS THE\nSITUATION AND PROCEED WITH STANDARD RESCUE AND RECOVERY\nPROTOCOLS.\n\nREPORT ALL FINDINGS VIA ENCRYPTED BURST TO WY RELAY\nNODE GAMMA-7.\n\nBUILDING BETTER WORLDS.\n\nAUTHORIZATION: FRONTIER OPERATIONS COORDINATOR\nCLASSIFICATION: RESTRICTED — CAPTAIN CLEARANCE"
    },
    {
      "id": "log-c002",
      "timestamp": "2183-05-21 03:41:00",
      "level": "",
      "default": true,
      "classification": "CORPORATE",
      "sender": "WY-COMMS",
      "subject": "SIGNAL INTERCEPT — USCSS CRONUS / SPECIAL ORDER 966",
      "mediaType": "text",
      "detail": "CONFIDENTIAL — WEYLAND-YUTANI CORPORATE TRANSMISSION\nREF: WY-SPD/SIGNAL-INTERCEPT-8713\nENCRYPTION: AES-4096 / BURST PROTOCOL SEVEN\n\nTO: WILSON, J. — COMPANY LIAISON (USCSS MONTERO)\nFROM: SPECIAL PROJECTS DIVISION — DEEP SPACE ASSET RECOVERY\n\nRE: SIGNAL INTERCEPT — USCSS CRONUS (REG. 142601)\n\nMR. WILSON,\n\nON 2183-05-19 AT 07:22 UST, WY DEEP SPACE RELAY NETWORK NODE\nGAMMA-7 INTERCEPTED A REPEATING DISTRESS SIGNAL ON FREQUENCY\n8713.41 ORIGINATING FROM DEEP SPACE BETWEEN ALPHA AURIGAE\nAND LAMBDA AURIGAE AT COORDINATES (24.3, 39.2). SIGNAL\nANALYSIS CONFIRMS TRANSMISSION SOURCE AS USCSS CRONUS, A\nWEYLAND SEV M3 HELIADES-CLASS SCIENCE EXPLORATION VESSEL\n(REG. 142601) LAUNCHED 2110. VESSEL WAS CLASSIFIED LOST\nIN 2112.\n\nTRAJECTORY ANALYSIS INDICATES THE CRONUS IS ADRIFT AT\nSUBLIGHT VELOCITY BETWEEN ALPHA AURIGAE AND LAMBDA AURIGAE.\nTHE MONTERO'S CURRENT TRANSIT CORRIDOR TO SUTTER'S WORLD\nPASSES WITHIN VIABLE INTERCEPT RANGE.\n\nTHIS RECOVERY OPPORTUNITY IS CONSIDERED PRIORITY ALPHA.\n\n--- SPECIAL ORDER 966 (REACTIVATED) ---\n\nYOU ARE HEREBY INFORMED THAT THE ORIGINAL CRONUS MISSION\nOPERATED UNDER SPECIAL ORDER 966, NOEROMO PROTOCOL.\nMISSION OBJECTIVE: RECOVERY AND ANALYSIS OF CHEMICAL AGENT\nA0-3959X.91-15, A BIOLOGICAL COMPOUND OF EXTRAORDINARY\nVALUE DISCOVERED ON PLANETOID LV-1113 IN THE 26 DRACONIS\nSYSTEM.\n\nTHE CRONUS CREW CONFIRMED RECOVERY OF SPECIMENS PRIOR TO\nLOSS OF CONTACT IN 2110. THERE IS A HIGH PROBABILITY THAT\nBIOLOGICAL SAMPLES REMAIN ABOARD THE VESSEL.\n\n--- YOUR DIRECTIVES ---\n\n1. THE MONTERO WILL BE AUTOMATICALLY REROUTED TO THE CRONUS\n   SIGNAL SOURCE VIA MU/TH/UR NAVIGATION OVERRIDE WHEN THE\n   VESSEL ENTERS INTERCEPT RANGE. CREW REVIVAL FROM CRYO\n   WILL BE TRIGGERED AT THAT TIME. THIS DIVERSION WILL BE\n   PRESENTED TO CAPTAIN MILLER UNDER SEARCH AND RESCUE\n   CLAUSE 8827.5, SUBSECTION B. DO NOT DISCLOSE THE TRUE\n   NATURE OF THE INTERCEPT.\n\n2. UPON BOARDING THE CRONUS, YOUR PRIMARY OBJECTIVE IS TO\n   LOCATE AND SECURE ANY SURVIVING BIOLOGICAL SPECIMENS\n   FROM THE ORIGINAL LV-1113 EXPEDITION. ALL BIOLOGICAL\n   MATERIAL IS WEYLAND-YUTANI PROPERTY UNDER PROTOCOL\n   WY-7741. SPECIMEN CONTAINMENT TAKES ABSOLUTE PRIORITY.\n\n3. SECONDARY OBJECTIVE: RECOVER ALL MISSION DATA, RESEARCH\n   LOGS, AND SCIENTIFIC RECORDS. NOTE THAT COMPANY LIAISON\n   LORI CLAYTON (CRONUS CREW) TRANSFERRED ORIGINAL RESEARCH\n   DATA TO A PORTABLE MEDIA CARTRIDGE (MCD) PRIOR TO LOSS\n   OF CONTACT. IF CLAYTON OR THE MCD ARE RECOVERABLE, THEY\n   ARE HIGH-VALUE ASSETS.\n\n4. THE CRONUS MAY CONTAIN SURVIVING CREW IN CRYOGENIC\n   STASIS. ANY SURVIVORS ARE TO BE REVIVED AND ASSESSED.\n   CREW WHO WERE EXPOSED TO CHEMICAL AGENT A0-3959X.91-15\n   ARE THEMSELVES CONSIDERED BIOLOGICAL ASSETS OF RESEARCH\n   VALUE. THE SHIP MEDIC — FLYNN, L. — IS FLAGGED AS A\n   PERSON OF INTEREST IN THIS REGARD.\n\n5. IF CIRCUMSTANCES REQUIRE, YOU ARE AUTHORIZED TO USE\n   YOUR CORPORATE COMMAND CODE (12726539) TO OVERRIDE\n   MONTERO SYSTEMS AND ENSURE COMPLIANCE WITH THESE\n   DIRECTIVES.\n\n--- WARNINGS ---\n\nTHE CRONUS WAS LOST UNDER HOSTILE CONDITIONS. FINAL\nTRANSMISSIONS INDICATED UNIDENTIFIED BIOLOGICAL CONTACTS\nABOARD THE VESSEL AND SIGNIFICANT STRUCTURAL DAMAGE.\nEXERCISE APPROPRIATE CAUTION DURING BOARDING OPERATIONS.\n\nDO NOT ALLOW THE MONTERO CREW TO DESTROY, JETTISON, OR\nOTHERWISE COMPROMISE ANY BIOLOGICAL MATERIAL FOUND ABOARD\nTHE CRONUS. SPECIMENS ARE TO BE PRESERVED AT ALL COSTS.\n\nALL OTHER CONSIDERATIONS ARE SECONDARY.\n\nTHIS TRANSMISSION WILL AUTO-PURGE FROM THE MONTERO COMMS\nBUFFER 72 HOURS AFTER FIRST ACCESS. SAVE LOCALLY IF\nREQUIRED.\n\nFAILURE TO COMPLY WILL RESULT IN FORFEITURE OF ALL\nCOMPENSATION, TERMINATION OF EMPLOYMENT, AND CRIMINAL\nPROSECUTION UNDER ICC CHARTER SECTION 7.\n\nBUILDING BETTER WORLDS.\n\nAUTHORIZATION: DIRECTOR HOLT — SPECIAL PROJECTS DIVISION\nSECONDARY: SPD-DIRECTOR MERIDIAN (ORIGINAL SO-966 AUTHORITY)\nCLASSIFICATION: WY-CORPORATE — EYES ONLY"
    },
    {
      "id": "log-n001",
      "timestamp": "2183-06-02 05:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "sender": "NAV",
      "subject": "FTL EXIT — SUBLIGHT TRANSITION",
      "mediaType": "text",
      "detail": "NAV SYSTEM — FTL EXIT REPORT\n\nFTL DRIVE DISENGAGED AT 05:00 UST.\n\nPOSITION: DEEP SPACE — COORDINATES (24.3, 39.2)\nSECTOR: BETWEEN ALPHA AURIGAE AND LAMBDA AURIGAE\n\nTRANSITIONING TO SUBLIGHT PROPULSION.\nSUBLIGHT SPEED: 80 METERS PER SECOND\nSIGNAL SOURCE BEARING: 127.4\nDISTANCE TO SIGNAL SOURCE: APPROXIMATELY 2,880 KM\nESTIMATED TIME TO SIGNAL SOURCE: 10 HOURS\n\nFUEL STATUS: 87.2% REMAINING\nENGINE STATUS: NOMINAL\n\nALL SYSTEMS GREEN."
    },
    {
      "id": "log-mu001",
      "timestamp": "2183-06-02 05:05:00",
      "level": "",
      "default": true,
      "classification": "MU/TH/UR",
      "sender": "MU/TH/UR",
      "subject": "CRYOSLEEP REVIVAL INITIATED",
      "mediaType": "text",
      "detail": "MU/TH/UR 6500 — CREW REVIVAL INITIATED\n\nNAVIGATION PROTOCOL TRIGGERED. FTL EXIT COMPLETE.\nINITIATING AUTOMATED CREW REVIVAL FROM CRYOGENIC HYPERSLEEP.\n\nALL CRYOPODS ACTIVATING REVIVAL SEQUENCE.\nESTIMATED REVIVAL TIME: 47 MINUTES.\n\nREASON FOR REVIVAL: PROXIMITY TO SIGNAL SOURCE.\nCOORDINATES: (24.3, 39.2)\n\nCREW BRIEFING WILL BE PROVIDED UPON FULL REVIVAL."
    },
    {
      "id": "log-001",
      "timestamp": "2183-06-02 06:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "sender": "SYSTEM",
      "subject": "CREW REVIVED FROM CRYOSLEEP",
      "mediaType": "text",
      "detail": "AUTOMATED CRYOSLEEP REVIVAL SEQUENCE COMPLETE.\nALL CRYOPODS REPORTING NOMINAL STATUS.\n\nPOD 01 — MILLER, V. — VITALS NOMINAL\nPOD 02 — DAVIS, L. — VITALS NOMINAL\nPOD 03 — RYE, K. — VITALS NOMINAL\nPOD 04 — CHAM, L. — VITALS NOMINAL\nPOD 05 — WILSON, J. — VITALS NOMINAL\n\nREVIVAL TIME: 47 MINUTES\nPOST-CRYO ASSESSMENT: ALL CREW FIT FOR DUTY"
    },
    {
      "id": "log-m001",
      "timestamp": "2183-06-02 06:02:00",
      "level": "",
      "default": true,
      "classification": "MEDICAL",
      "sender": "MEDICAL",
      "subject": "POST-CRYO MEDICAL CLEARANCE — ALL CREW",
      "mediaType": "text",
      "detail": "POST-CRYOSLEEP MEDICAL ASSESSMENT — ALL CREW\n\nMILLER, V. — FIT FOR DUTY. MILD CRYO-NAUSEA (STANDARD).\nDAVIS, L. — FIT FOR DUTY. NOTE: PRESCRIPTION RENEWAL OVERDUE.\nRYE, K. — FIT FOR DUTY. ELEVATED HEART RATE (STRESS-RELATED).\nCHAM, L. — FIT FOR DUTY. NO ANOMALIES.\nWILSON, J. — FIT FOR DUTY. NO ANOMALIES.\n\nNO CONTRAINDICATIONS FOR EVA OR HEAVY LABOR.\n\nAUTO-MED PRESCRIPTION STATUS:\n  DAVIS, L. — ANXIOLYTIC RX: 3 DOSES REMAINING. RENEWAL REQUIRED.\n\nNEXT MEDICAL CHECK: 24 HOURS POST-REVIVAL."
    },
    {
      "id": "log-002",
      "timestamp": "2183-06-02 06:05:00",
      "level": "warning",
      "default": true,
      "classification": "MU/TH/UR",
      "sender": "MU/TH/UR",
      "subject": "UNKNOWN SIGNAL DETECTED ON LONG-RANGE SENSORS",
      "mediaType": "text",
      "detail": "SIGNAL TYPE: REPEATING BURST TRANSMISSION\nFREQUENCY: 489.12 MHz (NON-STANDARD)\nSIGNAL STRENGTH: -72 dBm\nORIGIN: BEARING 127.4 / RANGE 2,880 KM\nSIGNAL DURATION: 12.7 SECONDS (REPEATING EVERY 180 SECONDS)\n\nANALYSIS: PATTERN DOES NOT MATCH ANY KNOWN WEYLAND-YUTANI, UPP, OR CIVILIAN BEACON PROTOCOL.\nCLASSIFICATION: UNKNOWN — POSSIBLE DISTRESS SIGNAL\n\nPER COMPANY STANDING ORDER ICC/WY-4720:\nALL COMMERCIAL VESSELS ARE OBLIGATED TO INVESTIGATE SIGNALS OF POSSIBLE INTELLIGENT ORIGIN.\n\nCOURSE HAS BEEN ADJUSTED TO INTERCEPT SIGNAL SOURCE.\nAWAITING BRIDGE AUTHORIZATION TO PROCEED WITH APPROACH."
    },
    {
      "id": "log-003",
      "timestamp": "2183-06-02 06:10:00",
      "level": "",
      "default": true,
      "classification": "",
      "sender": "NAV",
      "subject": "APPROACH AUTHORIZED — SIGNAL SOURCE",
      "mediaType": "text",
      "detail": "APPROACH VECTOR AUTHORIZED BY: CAPTAIN MILLER\n\nCURRENT HEADING: 127.4 / SIGNAL SOURCE\nSUBLIGHT SPEED: 80 METERS PER SECOND\nDISTANCE TO SIGNAL SOURCE: 2,860 KM\nESTIMATED ARRIVAL: 9.5 HOURS\n\nDIVERSION FROM ORIGINAL COURSE TO SUTTER'S WORLD CONFIRMED.\nORIGINAL ETA SUTTER'S WORLD: 2183-06-20\nREVISED ETA SUTTER'S WORLD: PENDING COMPLETION OF S&R OPERATIONS\n\nFUEL IMPACT: +2.4% RESERVE CONSUMPTION ESTIMATED FOR DIVERSION\nREMAINING FUEL: 87.2%\n\nAPPROACH AUTHORIZED UNDER ICC/WY-4720 AND S&R CLAUSE 8827.5.\nNAV COMPUTER UPDATED."
    },
    {
      "id": "log-n002",
      "timestamp": "2183-06-02 15:00:00",
      "level": "",
      "default": true,
      "classification": "SYSTEM",
      "sender": "NAV",
      "subject": "APPROACH UPDATE — 1 HOUR TO SIGNAL SOURCE",
      "mediaType": "text",
      "detail": "NAV SYSTEM — APPROACH UPDATE\n\nDISTANCE TO SIGNAL SOURCE: 288 KM\nSPEED: 80 METERS PER SECOND\nESTIMATED TIME TO SIGNAL SOURCE: 1 HOUR\n\nSIGNAL IDENTIFICATION: USCSS CRONUS (REG. 142601)\nVESSEL TYPE: HELIADES-CLASS SCIENCE EXPLORATION VESSEL\nVESSEL STATUS: LOW POWER — MINIMAL EMISSIONS DETECTED\n\nRECOMMENDATION: REDUCE APPROACH SPEED FOR FINAL MANEUVERING.\nAWAITING BRIDGE AUTHORIZATION FOR DOCKING PROTOCOL."
    }
  ]
}
